Tekla Open API Reference for Tekla Structures 2025
FontAttributes.Italic Property
 Whether the font is italic.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Italic { get; set; }
Public Property Italic As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FontAttributes Class
Tekla.Structures.Drawing Namespace